rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
    //Then check the external bus
    enable_twi_bus(EXTERNAL_TWI_INSTANCE_ID);
    twi_address_scan(external_sensors, &external_sensors_found, &m_twi_external);

    //Scan the external sensors to see if any of them match the default sensors that were
    //set in the settings array. If not, then scan the internal sensors to see if any of
    //them are there. If one of the default sensors isn't found on either bus then a
    //different one will need to be selected.
    if (external_sensors_found > 0)
    {
        for (int i = 0; i < 3; i++)
        {
            uint8_t default_sensor_address_l = get_sensor_low_address(i, default_sensors[i]);
            uint8_t default_sensor_address_h = get_sensor_high_address(i, default_sensors[i]);

            for (int j = 0; j < external_sensors_found; j++)
            {
                if (external_sensors[j] == default_sensor_address_l || external_sensors[j] == default_sensor_address_h)
                {
                    sensor_communication_init(i, default_sensors[i], external_sensors[j], &m_twi_external);
                    sensors_initialized[i] = true;
                    break; //if for whatever reason there are two of the same sensor on the line we only want to add the first one
                }
            }
        }
    }

    //See if all sensors we're initialized on the external bus, if not, then initialized sensors
    //from internal bus
    if (!sensors_initialized[0] || !sensors_initialized[1] || !sensors_initialized[2])
    {
        for (int i = 0; i < 3; i++)
        {
            if (sensors_initialized[i]) continue; //this sensor was initialized on the external bus so skip it
            uint8_t default_sensor_address_l = get_sensor_low_address(i, default_sensors[i]);
            uint8_t default_sensor_address_h = get_sensor_high_address(i, default_sensors[i]);

            for (int j = 0; j < internal_sensors_found; j++)
            {
                if (internal_sensors[j] == default_sensor_address_l || internal_sensors[j] == default_sensor_address_h)
                {
                    sensor_communication_init(i, default_sensors[i], internal_sensors[j], &m_twi_internal);
                    sensors_initialized[i] == true;
                    break; //if for whatever reason there are two of the same sensor on the line we only want to add the first one
                }
            }
        }
    }

    //Handle the initialization of individual sensors
    //TODO: Need some kind of variable to keep track of which sensor init methods to call, just use lsm9ds1 for now
    lsm9ds1_init(&imu_comm, 0b111, sensor_settings, &m_twi_external, &m_xfer_external_done, USE_EXTERNAL_SENSORS);

    //regardless of whether or not any sensors are found, disable the power pins and TWI bus
    disable_twi_bus(INTERNAL_TWI_INSTANCE_ID);
    disable_twi_bus(EXTERNAL_TWI_INSTANCE_ID);

    //After all sensors have been initialized, update the sensor settings characteristic to 
    //reflect the sensor settings array. Furthermore, we also set the connection interval 
    //to be equal to the highest sensor ODR (to the nearest 15th millisecond)
    ble_gatts_value_t settings;
    settings.len = SENSOR_SETTINGS_LENGTH;
    settings.p_value = sensor_settings;
    settings.offset = 0;
    uint32_t err_code = sd_ble_gatts_value_set(m_conn_handle, m_ss.settings_handles.value_handle, &settings);
    APP_ERROR_CHECK(err_code);
}

static void characteristic_update_and_notify()
{
    
    ble_gatts_hvx_params_t acc_notify_params, gyr_notify_params, mag_notify_params;
    memset(&acc_notify_params, 0, sizeof(acc_notify_params));
    memset(&gyr_notify_params, 0, sizeof(gyr_notify_params));
    memset(&mag_notify_params, 0, sizeof(mag_notify_params));

    uint16_t data_characteristic_size = SENSOR_SAMPLES * SAMPLE_SIZE; //not really sure why the size needs to be passed in as a reference

    //Setup accelerometer notification first
    acc_notify_params.type = BLE_GATT_HVX_NOTIFICATION;
    acc_notify_params.handle = m_ss.data_handles[0].value_handle;
    acc_notify_params.p_data = acc_characteristic_data;
    acc_notify_params.p_len  = &data_characteristic_size;
    acc_notify_params.offset = 0;

    //Setup gyroscope notification second
    gyr_notify_params.type = BLE_GATT_HVX_NOTIFICATION;
    gyr_notify_params.handle = m_ss.data_handles[1].value_handle;
    gyr_notify_params.p_data = gyr_characteristic_data;
    gyr_notify_params.p_len  = &data_characteristic_size;
    gyr_notify_params.offset = 0;

    //Setup magnetometer notification third
    mag_notify_params.type = BLE_GATT_HVX_NOTIFICATION;
    mag_notify_params.handle = m_ss.data_handles[2].value_handle;
    mag_notify_params.p_data = mag_characteristic_data;
    mag_notify_params.p_len  = &data_characteristic_size;
    mag_notify_params.offset = 0;

    sd_ble_gatts_hvx(m_conn_handle, &acc_notify_params);
    sd_ble_gatts_hvx(m_conn_handle, &gyr_notify_params);
    sd_ble_gatts_hvx(m_conn_handle, &mag_notify_params);
}

static void data_reading_timer_handler(void * p_context)
{
    //uint32_t time_stamp = nrf_drv_timer_capture(&my_timer, NRF_TIMER_CC_CHANNEL1);
    //float clock_conversion = 1.0 / 16000000.0;
    //float actual_time = time_stamp * clock_conversion;
    //SEGGER_RTT_printf(0, "TWI initiated at %u ticks of 16MHz.\n", time_stamp);

    //Everytime the data reading timer goes off we take sensor readings and then 
    //update the appropriate characteristic values. The timer should go off once
    //every connection interval
    get_IMU_data(SAMPLE_SIZE * measurements_taken);
    get_MAG_data(SAMPLE_SIZE * measurements_taken);
    measurements_taken++;

    //TEST: bytes aren't being updated correctly
    //SEGGER_RTT_WriteString(0, "Bytes going into gyro characteristic should be:\n");
    //for (int i = 0; i < SENSOR_SAMPLES * SAMPLE_SIZE; i++) SEGGER_RTT_printf(0, "0x%#01x ", *(gyr_characteristic_data + i));
    //SEGGER_RTT_WriteString(0, "\n\n");

    //after the samples are read, update the characteristics and notify
    if ( measurements_taken == SENSOR_SAMPLES)
    {
        //SEGGER_RTT_WriteString(0, "Sending the following bytes to Acc characteristic:\n");
        //for (int i = 0; i < SENSOR_SAMPLES; i++)
        //{
        //    for (int j = 0; j < SAMPLE_SIZE; j++)
        //    {
        //        SEGGER_RTT_printf(0, "0x%#01x ", *(acc_characteristic_data + i * SENSOR_SAMPLES + j));
        //    }
        //    SEGGER_RTT_WriteString(0, "\n");
        //}
        //SEGGER_RTT_WriteString(0, "\n");

        characteristic_update_and_notify();
        measurements_taken = 0; //reset the data counter
    }
}

static void led_timer_handler(void * p_context)
{
    //This timer causes the currently active LED to light up. A separate timer is used to 
    //turn the LED back off after a set time period
    if (USE_EXTERNAL_LEDS) nrf_gpio_pin_set(active_led);
    else nrf_gpio_pin_clear(active_led);

    nrf_drv_timer_clear(&LED_ON_TIMER); //reset the LED-on timer
    nrf_drv_timer_enable(&LED_ON_TIMER); //turn on the LED_on timer, the handler for this timer will turn the LED back off
    //uint32_t timer_val = nrf_drv_timer_capture(&LED_ON_TIMER, NRF_TIMER_CC_CHANNEL1);
}

void led_on_timer_handler(nrf_timer_event_t event_type, void* p_context)
{
    //This handler gets called when an LED is turned to the active state. Simply turn the 
    //LED back off when this handler is called and then turn the LED-on timer off.
    if (USE_EXTERNAL_LEDS) nrf_gpio_pin_clear(active_led);
    else nrf_gpio_pin_set(active_led);
    nrf_drv_timer_disable(&LED_ON_TIMER);
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    // Initialize timer module.
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

